{
  "</answer>": 151686,
  "</box>": 151674,
  "</focus>": 151688,
  "</image>": 151670,
  "</image_id>": 151682,
  "</image_save_to>": 151696,
  "</line>": 151690,
  "</perception>": 151692,
  "</point>": 151678,
  "</quad>": 151676,
  "</ref>": 151672,
  "</slice>": 151680,
  "</source_image>": 151694,
  "</think>": 151668,
  "</tool_call>": 151658,
  "</tool_response>": 151666,
  "</unit>": 151684,
  "<answer>": 151685,
  "<box>": 151673,
  "<focus>": 151687,
  "<image>": 151669,
  "<image_id>": 151681,
  "<image_save_to>": 151695,
  "<line>": 151689,
  "<perception>": 151691,
  "<point>": 151677,
  "<quad>": 151675,
  "<ref>": 151671,
  "<slice>": 151679,
  "<source_image>": 151693,
  "<think>": 151667,
  "<tool_call>": 151657,
  "<tool_response>": 151665,
  "<unit>": 151683,
  "<|audio_end|>": 151699,
  "<|audio_start|>": 151697,
  "<|audio|>": 151698,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|emotion_end|>": 151711,
  "<|emotion_start|>": 151710,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|interrupt|>": 151707,
  "<|listen|>": 151705,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|pitch_end|>": 151715,
  "<|pitch_start|>": 151714,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|speak|>": 151706,
  "<|speed_end|>": 151713,
  "<|speed_start|>": 151712,
  "<|spk_bos|>": 151700,
  "<|spk_eos|>": 151702,
  "<|spk|>": 151701,
  "<|turn_bos|>": 151716,
  "<|timbre_10|>": 151726,
  "<|timbre_11|>": 151727,
  "<|timbre_12|>": 151728,
  "<|timbre_13|>": 151729,
  "<|timbre_14|>": 151730,
  "<|timbre_15|>": 151731,
  "<|timbre_16|>": 151732,
  "<|timbre_17|>": 151733,
  "<|timbre_18|>": 151734,
  "<|timbre_19|>": 151735,
  "<|turn_eos|>": 151717,
  "<|timbre_20|>": 151736,
  "<|timbre_21|>": 151737,
  "<|timbre_22|>": 151738,
  "<|timbre_23|>": 151739,
  "<|timbre_24|>": 151740,
  "<|timbre_25|>": 151741,
  "<|timbre_26|>": 151742,
  "<|timbre_27|>": 151743,
  "<|timbre_28|>": 151744,
  "<|timbre_29|>": 151745,
  "<|chunk_eos|>": 151718,
  "<|timbre_30|>": 151746,
  "<|timbre_31|>": 151747,
  "<|chunk_bos|>": 151719,
  "<|chunk_tts_bos|>": 151720,
  "<|chunk_tts_eos|>": 151721,
  "<|tts_pad|>": 151722,
  "<|timbre_7|>": 151723,
  "<|timbre_8|>": 151724,
  "<|timbre_9|>": 151725,
  "<|tts_bos|>": 151703,
  "<|tts_eos|>": 151704,
  "<|vad_end|>": 151709,
  "<|vad_start|>": 151708,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
