{
  "add_bos_token": false,
  "add_prefix_space": false,
  "added_tokens_decoder": {
    "128244": {
      "content": "<unk>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151643": {
      "content": "<|endoftext|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151644": {
      "content": "<|im_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151645": {
      "content": "<|im_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151646": {
      "content": "<|object_ref_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151647": {
      "content": "<|object_ref_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151648": {
      "content": "<|box_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151649": {
      "content": "<|box_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151650": {
      "content": "<|quad_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151651": {
      "content": "<|quad_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151652": {
      "content": "<|vision_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151653": {
      "content": "<|vision_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151654": {
      "content": "<|vision_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151655": {
      "content": "<|image_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151656": {
      "content": "<|video_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151657": {
      "content": "<tool_call>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151658": {
      "content": "</tool_call>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151659": {
      "content": "<|fim_prefix|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151660": {
      "content": "<|fim_middle|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151661": {
      "content": "<|fim_suffix|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151662": {
      "content": "<|fim_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151663": {
      "content": "<|repo_name|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151664": {
      "content": "<|file_sep|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151665": {
      "content": "<tool_response>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151666": {
      "content": "</tool_response>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151667": {
      "content": "<think>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151668": {
      "content": "</think>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151669": {
      "content": "<image>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151670": {
      "content": "</image>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151671": {
      "content": "<ref>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151672": {
      "content": "</ref>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151673": {
      "content": "<box>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151674": {
      "content": "</box>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151675": {
      "content": "<quad>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151676": {
      "content": "</quad>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151677": {
      "content": "<point>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151678": {
      "content": "</point>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151679": {
      "content": "<slice>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151680": {
      "content": "</slice>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151681": {
      "content": "<image_id>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151682": {
      "content": "</image_id>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151683": {
      "content": "<unit>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151684": {
      "content": "</unit>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151685": {
      "content": "<answer>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151686": {
      "content": "</answer>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151687": {
      "content": "<focus>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151688": {
      "content": "</focus>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151689": {
      "content": "<line>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151690": {
      "content": "</line>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151691": {
      "content": "<perception>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151692": {
      "content": "</perception>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151693": {
      "content": "<source_image>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151694": {
      "content": "</source_image>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151695": {
      "content": "<image_save_to>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151696": {
      "content": "</image_save_to>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151697": {
      "content": "<|audio_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151698": {
      "content": "<|audio|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151699": {
      "content": "<|audio_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151700": {
      "content": "<|spk_bos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151701": {
      "content": "<|spk|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151702": {
      "content": "<|spk_eos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151703": {
      "content": "<|tts_bos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151704": {
      "content": "<|tts_eos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151705": {
      "content": "<|listen|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151706": {
      "content": "<|speak|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151707": {
      "content": "<|interrupt|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151708": {
      "content": "<|vad_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151709": {
      "content": "<|vad_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151710": {
      "content": "<|emotion_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151711": {
      "content": "<|emotion_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151712": {
      "content": "<|speed_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151713": {
      "content": "<|speed_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151714": {
      "content": "<|pitch_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151715": {
      "content": "<|pitch_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151716": {
      "content": "<|turn_bos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151717": {
      "content": "<|turn_eos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151718": {
      "content": "<|chunk_eos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151719": {
      "content": "<|chunk_bos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151720": {
      "content": "<|chunk_tts_bos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151721": {
      "content": "<|chunk_tts_eos|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151722": {
      "content": "<|tts_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151723": {
      "content": "<|timbre_7|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151724": {
      "content": "<|timbre_8|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151725": {
      "content": "<|timbre_9|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151726": {
      "content": "<|timbre_10|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151727": {
      "content": "<|timbre_11|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151728": {
      "content": "<|timbre_12|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151729": {
      "content": "<|timbre_13|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151730": {
      "content": "<|timbre_14|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151731": {
      "content": "<|timbre_15|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151732": {
      "content": "<|timbre_16|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151733": {
      "content": "<|timbre_17|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151734": {
      "content": "<|timbre_18|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151735": {
      "content": "<|timbre_19|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151736": {
      "content": "<|timbre_20|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151737": {
      "content": "<|timbre_21|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151738": {
      "content": "<|timbre_22|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151739": {
      "content": "<|timbre_23|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151740": {
      "content": "<|timbre_24|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151741": {
      "content": "<|timbre_25|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151742": {
      "content": "<|timbre_26|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151743": {
      "content": "<|timbre_27|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151744": {
      "content": "<|timbre_28|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151745": {
      "content": "<|timbre_29|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151746": {
      "content": "<|timbre_30|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151747": {
      "content": "<|timbre_31|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "additional_special_tokens": [
    "<unk>",
    "<image>",
    "</image>",
    "<ref>",
    "</ref>",
    "<box>",
    "</box>",
    "<quad>",
    "</quad>",
    "<point>",
    "</point>",
    "<slice>",
    "</slice>",
    "<image_id>",
    "</image_id>",
    "<unit>",
    "</unit>",
    "<answer>",
    "</answer>",
    "<focus>",
    "</focus>",
    "<line>",
    "</line>",
    "<perception>",
    "</perception>",
    "<source_image>",
    "</source_image>",
    "<image_save_to>",
    "</image_save_to>",
    "<|audio_start|>",
    "<|audio|>",
    "<|audio_end|>",
    "<|spk_bos|>",
    "<|spk|>",
    "<|spk_eos|>",
    "<|tts_bos|>",
    "<|tts_eos|>",
    "<|listen|>",
    "<|speak|>",
    "<|interrupt|>",
    "<|vad_start|>",
    "<|vad_end|>",
    "<|emotion_start|>",
    "<|emotion_end|>",
    "<|speed_start|>",
    "<|speed_end|>",
    "<|pitch_start|>",
    "<|pitch_end|>",
    "<|chunk_eos|>",
    "<|chunk_bos|>",
    "<|chunk_tts_bos|>",
    "<|chunk_tts_eos|>",
    "<|tts_pad|>",
    "<|timbre_7|>",
    "<|timbre_8|>",
    "<|timbre_9|>",
    "<|timbre_10|>",
    "<|timbre_11|>",
    "<|timbre_12|>",
    "<|timbre_13|>",
    "<|timbre_14|>",
    "<|timbre_15|>",
    "<|timbre_16|>",
    "<|timbre_17|>",
    "<|timbre_18|>",
    "<|timbre_19|>",
    "<|timbre_20|>",
    "<|timbre_21|>",
    "<|timbre_22|>",
    "<|timbre_23|>",
    "<|timbre_24|>",
    "<|timbre_25|>",
    "<|timbre_26|>",
    "<|timbre_27|>",
    "<|timbre_28|>",
    "<|timbre_29|>",
    "<|timbre_30|>",
    "<|timbre_31|>"
  ],
  "bos_token": "<|im_start|>",
  "chat_template": "{%- if tools %}\n    {{- '<|im_start|>system\\n' }}\n    {%- if messages[0].role == 'system' %}\n        {{- messages[0].content + '\\n\\n' }}\n    {%- endif %}\n    {{- \"# Tools\\n\\nYou may call one or more functions to assist with the user query.\\n\\nYou are provided with function signatures within <tools></tools> XML tags:\\n<tools>\" }}\n    {%- for tool in tools %}\n        {{- \"\\n\" }}\n        {{- tool | tojson }}\n    {%- endfor %}\n    {{- \"\\n</tools>\\n\\nFor each function call, return a json object with function name and arguments within <tool_call></tool_call> XML tags:\\n<tool_call>\\n{\\\"name\\\": <function-name>, \\\"arguments\\\": <args-json-object>}\\n</tool_call><|im_end|>\\n\" }}\n{%- else %}\n    {%- if messages[0].role == 'system' %}\n        {{- '<|im_start|>system\\n' + messages[0].content + '<|im_end|>\\n' }}\n    {%- endif %}\n{%- endif %}\n{%- set ns = namespace(multi_step_tool=true, last_query_index=messages|length - 1) %}\n{%- for message in messages[::-1] %}\n    {%- set index = (messages|length - 1) - loop.index0 %}\n    {%- if ns.multi_step_tool and message.role == \"user\" and not(message.content.startswith('<tool_response>') and message.content.endswith('</tool_response>')) %}\n        {%- set ns.multi_step_tool = false %}\n        {%- set ns.last_query_index = index %}\n    {%- endif %}\n{%- endfor %}\n{%- for message in messages %}\n    {%- if (message.role == \"user\") or (message.role == \"system\" and not loop.first) %}\n        {{- '<|im_start|>' + message.role + '\\n' + message.content + '<|im_end|>' + '\\n' }}\n    {%- elif message.role == \"assistant\" %}\n        {%- set content = message.content %}\n        {%- set reasoning_content = '' %}\n        {%- if message.reasoning_content is defined and message.reasoning_content is not none %}\n            {%- set reasoning_content = message.reasoning_content %}\n        {%- else %}\n            {%- if '</think>' in message.content %}\n                {%- set content = message.content.split('</think>')[-1].lstrip('\\n') %}\n                {%- set reasoning_content = message.content.split('</think>')[0].rstrip('\\n').split('<think>')[-1].lstrip('\\n') %}\n            {%- endif %}\n        {%- endif %}\n        {%- if loop.index0 > ns.last_query_index %}\n            {%- if loop.last or (not loop.last and reasoning_content) %}\n                {{- '<|im_start|>' + message.role + '\\n<think>\\n' + reasoning_content.strip('\\n') + '\\n</think>\\n\\n' + content.lstrip('\\n') }}\n            {%- else %}\n                {{- '<|im_start|>' + message.role + '\\n' + content }}\n            {%- endif %}\n        {%- else %}\n            {{- '<|im_start|>' + message.role + '\\n' + content }}\n        {%- endif %}\n        {%- if message.tool_calls %}\n            {%- for tool_call in message.tool_calls %}\n                {%- if (loop.first and content) or (not loop.first) %}\n                    {{- '\\n' }}\n                {%- endif %}\n                {%- if tool_call.function %}\n                    {%- set tool_call = tool_call.function %}\n                {%- endif %}\n                {{- '<tool_call>\\n{\"name\": \"' }}\n                {{- tool_call.name }}\n                {{- '\", \"arguments\": ' }}\n                {%- if tool_call.arguments is string %}\n                    {{- tool_call.arguments }}\n                {%- else %}\n                    {{- tool_call.arguments | tojson }}\n                {%- endif %}\n                {{- '}\\n</tool_call>' }}\n            {%- endfor %}\n        {%- endif %}\n        {{- '<|im_end|>\\n' }}\n    {%- elif message.role == \"tool\" %}\n        {%- if loop.first or (messages[loop.index0 - 1].role != \"tool\") %}\n            {{- '<|im_start|>user' }}\n        {%- endif %}\n        {{- '\\n<tool_response>\\n' }}\n        {{- message.content }}\n        {{- '\\n</tool_response>' }}\n        {%- if loop.last or (messages[loop.index0 + 1].role != \"tool\") %}\n            {{- '<|im_end|>\\n' }}\n        {%- endif %}\n    {%- endif %}\n{%- endfor %}\n{%- if add_generation_prompt %}\n    {{- '<|im_start|>assistant\\n' }}\n    {%- if enable_thinking is defined and enable_thinking is false %}\n        {{- '<think>\\n\\n</think>\\n\\n' }}\n    {%- endif %}\n    {%- if use_tts_template is defined and use_tts_template is true %}\n        {{- '<|tts_bos|>' }}\n    {%- endif %}\n{%- endif %}",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|im_end|>",
  "errors": "replace",
  "extra_special_tokens": {},
  "model_max_length": 131072,
  "pad_token": "<|endoftext|>",
  "split_special_tokens": false,
  "tokenizer_class": "MiniCPMOTokenizerFast",
  "unk_token": "<unk>",
  "auto_map": {
    "AutoTokenizer": [
      "tokenization_minicpmo_fast.MiniCPMOTokenizerFast",
      null
    ]
  },
  "bad_token_ids": [
    7,
    8,
    94,
    95,
    96,
    97,
    98,
    99,
    100,
    101,
    102,
    103,
    104,
    105,
    106,
    107,
    108,
    109,
    110,
    111,
    112,
    113,
    114,
    115,
    116,
    117,
    118,
    119,
    120,
    121,
    122,
    123,
    124,
    125,
    126,
    127,
    128,
    129,
    130,
    131,
    132,
    133,
    134,
    135,
    136,
    137,
    138,
    139,
    140,
    141,
    142,
    143,
    144,
    145,
    146,
    147,
    148,
    149,
    150,
    151,
    152,
    153,
    154,
    155,
    156,
    157,
    158,
    159,
    160,
    161,
    162,
    163,
    164,
    165,
    166,
    167,
    168,
    169,
    170,
    171,
    172,
    173,
    174,
    175,
    176,
    177,
    178,
    179,
    180,
    181,
    182,
    183,
    184,
    185,
    186,
    187,
    198,
    201,
    222,
    223,
    224,
    225,
    226,
    227,
    228,
    229,
    230,
    231,
    232,
    233,
    234,
    235,
    236,
    237,
    238,
    239,
    240,
    241,
    242,
    243,
    244,
    245,
    246,
    247,
    248,
    249,
    250,
    251,
    252,
    253,
    254,
    255,
    271,
    280,
    317,
    319,
    320,
    340,
    341,
    345,
    368,
    378,
    382,
    397,
    401,
    445,
    456,
    463,
    492,
    510,
    515,
    532,
    543,
    555,
    568,
    593,
    624,
    626,
    630,
    636,
    692,
    698,
    699,
    701,
    715,
    735,
    736,
    741,
    751,
    756,
    797,
    863,
    871,
    873,
    876,
    881,
    899,
    921,
    935,
    955,
    972,
    982,
    1005,
    1006,
    1010,
    1019,
    1022,
    1066,
    1106,
    1138,
    1141,
    1153,
    1155,
    1157,
    1171,
    1188,
    1193,
    1213,
    1215,
    1218,
    1248,
    1255,
    1259,
    1264,
    1277,
    1278,
    1295,
    1305,
    1326,
    1337,
    1339,
    1394,
    1406,
    1423,
    1428,
    1433,
    1439,
    1445,
    1447,
    1476,
    1500,
    1505,
    1507,
    1540,
    1548,
    1554,
    1572,
    1583,
    1625,
    1647,
    1648,
    1666,
    1683,
    1686,
    1711,
    1719,
    1727,
    1747,
    1755,
    1771,
    1781,
    1789,
    1823,
    1827,
    1837,
    1871,
    1883,
    1926,
    1939,
    1956,
    2012,
    2026,
    2075,
    2099,
    2129,
    2139,
    2140,
    2146,
    2194,
    2217,
    2219,
    2226,
    2235,
    2242,
    2262,
    2278,
    2289,
    2303,
    2306,
    2315,
    2333,
    2357,
    2376,
    2394,
    2398,
    2399,
    2440,
    2457,
    2467,
    2490,
    2529,
    2533,
    2546,
    2553,
    2558,
    2561,
    2570,
    2586,
    2592,
    2597,
    2601,
    2605,
    2741,
    2751,
    2759,
    2761,
    2775,
    2785,
    2791,
    2815,
    2822,
    2834,
    2837,
    2858,
    2877,
    2879,
    2920,
    2960,
    3011,
    3023,
    3025,
    3032,
    3044,
    3071,
    3079,
    3148,
    3153,
    3189,
    3190,
    3203,
    3211,
    3219,
    3224,
    3237,
    3268,
    3269,
    3276,
    3284,
    3299,
    3302,
    3315,
    3325,
    3374,
    3396,
    3402,
    3407,
    3456,
    3471,
    3475,
    3485,
    3489,
    3490,
    3507,
    3515,
    3518,
    3534,
    3554,
    3568,
    3576,
    3584,
    3593,
    3609,
    3610,
    3622,
    3623,
    3634,
    3646,
    3648,
    3659,
    3679,
    3715,
    3724,
    3733,
    3747,
    3755,
    3759,
    3764,
    3789,
    3804,
    3860,
    3870,
    3876,
    3879,
    3913,
    3932,
    3964,
    3975,
    3989,
    3997,
    4010,
    4015,
    4035,
    4071,
    4080,
    4140,
    4167,
    4175,
    4192,
    4199,
    4257,
    4277,
    4283,
    4291,
    4292,
    4319,
    4333,
    4346,
    4380,
    4386,
    4390,
    4397,
    4424,
    4430,
    4432,
    4455,
    4456,
    4461,
    4474,
    4539,
    4546,
    4555,
    4557,
    4567,
    4579,
    4590,
    4609,
    4610,
    4639,
    4660,
    4667,
    4710,
    4723,
    4806,
    4811,
    4821,
    4857,
    4860,
    4866,
    4875,
    4877,
    4891,
    4894,
    4919,
    4921,
    4930,
    4945,
    4956,
    4957,
    4967,
    4973,
    5031,
    5038,
    5065,
    5078,
    5125,
    5130,
    5133,
    5134,
    5140,
    5194,
    5210,
    5231,
    5267,
    5304,
    5349,
    5378,
    5384,
    5393,
    5410,
    5422,
    5432,
    5433,
    5434,
    5438,
    5453,
    5455,
    5463,
    5468,
    5484,
    5502,
    5513,
    5550,
    5563,
    5564,
    5581,
    5613,
    5618,
    5620,
    5661,
    5680,
    5684,
    5691,
    5731,
    5758,
    5783,
    5784,
    5801,
    5808,
    5809,
    5860,
    5872,
    5894,
    5895,
    5900,
    5902,
    5905,
    5907,
    5928,
    5929,
    5945,
    5953,
    5957,
    5959,
    5960,
    5966,
    5969,
    5993,
    6011,
    6060,
    6098,
    6107,
    6110,
    6114,
    6138,
    6142,
    6163,
    6201,
    6204,
    6211,
    6228,
    6235,
    6253,
    6260,
    6274,
    6320,
    6332,
    6336,
    6360,
    6390,
    6413,
    6416,
    6421,
    6425,
    6475,
    6518,
    6522,
    6557,
    6561,
    6564,
    6567,
    6571,
    6599,
    6606,
    6620,
    6636,
    6684,
    6699,
    6734,
    6762,
    6779,
    6796,
    6856,
    6870,
    6881,
    6882,
    6901,
    6903,
    6913,
    6926,
    6933,
    6958,
    6965,
    6987,
    7021,
    7026,
    7045,
    7088,
    7115,
    7129,
    7144,
    7158,
    7165,
    7195,
    7213,
    7229,
    7235,
    7252,
    7257,
    7287,
    7307,
    7311,
    7317,
    7318,
    7320,
    7331,
    7333,
    7356,
    7360,
    7367,
    7368,
    7392,
    7457,
    7492,
    7502,
    7511,
    7520,
    7534,
    7536,
    7537,
    7547,
    7552,
    7569,
    7588,
    7613,
    7620,
    7624,
    7631,
    7635,
    7644,
    7694,
    7705,
    7723,
    7731,
    7805,
    7832,
    7835,
    7851,
    7885,
    7908,
    8006,
    8013,
    8022,
    8032,
    8068,
    8079,
    8096,
    8097,
    8119,
    8132,
    8154,
    8158,
    8204,
    8244,
    8268,
    8283,
    8306,
    8324,
    8361,
    8389,
    8390,
    8401,
    8488,
    8508,
    8519,
    8525,
    8533,
    8563,
    8588,
    8616,
    8620,
    8623,
    8637,
    8680,
    8739,
    8754,
    8762,
    8797,
    8803,
    8805,
    8824,
    8839,
    8843,
    8902,
    8908,
    8917,
    8945,
    8956,
    8972,
    8997,
    8998,
    9035,
    9049,
    9098,
    9139,
    9147,
    9206,
    9231,
    9248,
    9260,
    9272,
    9284,
    9304,
    9321,
    9338,
    9340,
    9365,
    9401,
    9404,
    9469,
    9470,
    9531,
    9533,
    9541,
    9563,
    9568,
    9577,
    9604,
    9607,
    9623,
    9638,
    9639,
    9640,
    9697,
    9719,
    9722,
    9730,
    9739,
    9743,
    9747,
    9758,
    9764,
    9791,
    9828,
    9843,
    9849,
    9879,
    9900,
    9909,
    9912,
    9921,
    9940,
    9957,
    9973,
    9992,
    10040,
    10075,
    10079,
    10081,
    10086,
    10108,
    10116,
    10131,
    10133,
    10149,
    10170,
    10171,
    10203,
    10236,
    10239,
    10278,
    10293,
    10297,
    10340,
    10343,
    10346,
    10368,
    10370,
    10384,
    10389,
    10407,
    10417,
    10419,
    10444,
    10448,
    10452,
    10478,
    10483,
    10556,
    10569,
    10583,
    10595,
    10624,
    10639,
    10662,
    10663,
    10683,
    10697,
    10699,
    10722,
    10727,
    10731,
    10741,
    10764,
    10768,
    10874,
    10896,
    10907,
    10937,
    10939,
    10941,
    10947,
    10952,
    10959,
    10961,
    10977,
    10996,
    11014,
    11022,
    11024,
    11043,
    11057,
    11120,
    11125,
    11132,
    11142,
    11146,
    11162,
    11166,
    11173,
    11195,
    11248,
    11322,
    11328,
    11334,
    11336,
    11378,
    11384,
    11436,
    11462,
    11481,
    11484,
    11488,
    11512,
    11520,
    11534,
    11557,
    11559,
    11583,
    11600,
    11614,
    11620,
    11621,
    11648,
    11688,
    11700,
    11730,
    11743,
    11776,
    11781,
    11801,
    11805,
    11843,
    11858,
    11884,
    11895,
    11970,
    11973,
    11974,
    11985,
    11993,
    11995,
    12006,
    12022,
    12024,
    12047,
    12078,
    12084,
    12113,
    12130,
    12143,
    12145,
    12148,
    12186,
    12236,
    12259,
    12266,
    12274,
    12279,
    12286,
    12298,
    12306,
    12310,
    12317,
    12367,
    12381,
    12397,
    12410,
    12431,
    12437,
    12470,
    12489,
    12491,
    12504,
    12512,
    12520,
    12526,
    12530,
    12531,
    12533,
    12573,
    12584,
    12585,
    12587,
    12602,
    12619,
    12628,
    12663,
    12668,
    12706,
    12760,
    12787,
    12797,
    12798,
    12805,
    12806,
    12832,
    12860,
    12861,
    12892,
    12918,
    12924,
    12950,
    12951,
    12954,
    13003,
    13005,
    13053,
    13056,
    13058,
    13087,
    13092,
    13106,
    13116,
    13135,
    13148,
    13165,
    13174,
    13201,
    13204,
    13211,
    13246,
    13268,
    13274,
    13285,
    13287,
    13321,
    13338,
    13344,
    13345,
    13362,
    13426,
    13441,
    13453,
    13456,
    13465,
    13493,
    13512,
    13519,
    13531,
    13555,
    13558,
    13567,
    13645,
    13698,
    13744,
    13749,
    13836,
    13838,
    13846,
    13861,
    13869,
    13887,
    13913,
    13921,
    13941,
    13949,
    13976,
    13982,
    13988,
    14001,
    14013,
    14015,
    14031,
    14088,
    14090,
    14094,
    14108,
    14146,
    14160,
    14161,
    14167,
    14171,
    14208,
    14217,
    14223,
    14273,
    14280,
    14288,
    14326,
    14328,
    14333,
    14362,
    14368,
    14382,
    14414,
    14426,
    14437,
    14442,
    14451,
    14467,
    14498,
    14512,
    14520,
    14546,
    14559,
    14573,
    14599,
    14618,
    14621,
    14654,
    14669,
    14675,
    14676,
    14687,
    14702,
    14705,
    14711,
    14731,
    14750,
    14808,
    14818,
    14922,
    14925,
    14929,
    14936,
    14942,
    14959,
    14979,
    14998,
    15005,
    15014,
    15028,
    15046,
    15047,
    15049,
    15063,
    15075,
    15076,
    15078,
    15084,
    15087,
    15096,
    15127,
    15143,
    15146,
    15157,
    15197,
    15213,
    15224,
    15225,
    15238,
    15240,
    15253,
    15290,
    15297,
    15299,
    15306,
    15329,
    15348,
    15362,
    15374,
    15393,
    15397,
    15414,
    15424,
    15434,
    15436,
    15441,
    15452,
    15483,
    15514,
    15538,
    15573,
    15600,
    15617,
    15620,
    15639,
    15674,
    15675,
    15677,
    15694,
    15716,
    15746,
    15752,
    15761,
    15766,
    15785,
    15793,
    15798,
    15799,
    15827,
    15842,
    15852,
    15861,
    15865,
    15896,
    15899,
    15902,
    15906,
    15912,
    15921,
    15927,
    15956,
    15979,
    15984,
    15989,
    16018,
    16043,
    16057,
    16060,
    16075,
    16094,
    16117,
    16159,
    16160,
    16179,
    16218,
    16235,
    16240,
    16264,
    16315,
    16324,
    16360,
    16361,
    16368,
    16418,
    16425,
    16448,
    16466,
    16499,
    16511,
    16512,
    16518,
    16630,
    16633,
    16640,
    16667,
    16707,
    16738,
    16747,
    16751,
    16760,
    16778,
    16813,
    16817,
    16825,
    16860,
    16863,
    16864,
    16885,
    16909,
    16913,
    16921,
    16930,
    16968,
    16975,
    16978,
    16980,
    17008,
    17016,
    17027,
    17036,
    17049,
    17055,
    17057,
    17084,
    17094,
    17096,
    17118,
    17135,
    17140,
    17156,
    17158,
    17185,
    17199,
    17223,
    17255,
    17260,
    17262,
    17277,
    17284,
    17351,
    17383,
    17400,
    17401,
    17409,
    17419,
    17429,
    17435,
    17462,
    17467,
    17476,
    17477,
    17483,
    17525,
    17550,
    17554,
    17560,
    17566,
    17587,
    17591,
    17607,
    17609,
    17621,
    17622,
    17634,
    17641,
    17642,
    17643,
    17671,
    17690,
    17701,
    17705,
    17706,
    17729,
    17730,
    17745,
    17767,
    17783,
    17794,
    17815,
    17825,
    17826,
    17830,
    17844,
    17848,
    17868,
    17894,
    17918,
    17928,
    17935,
    17973,
    17981,
    17989,
    18005,
    18059,
    18082,
    18113,
    18137,
    18140,
    18205,
    18208,
    18221,
    18236,
    18238,
    18259,
    18268,
    18285,
    18292,
    18334,
    18363,
    18364,
    18381,
    18390,
    18396,
    18421,
    18459,
    18505,
    18507,
    18535,
    18543,
    18544,
    18552,
    18556,
    18574,
    18584,
    18585,
    18591,
    18611,
    18639,
    18682,
    18722,
    18733,
    18742,
    18751,
    18754,
    18769,
    18772,
    18797,
    18811,
    18850,
    18893,
    18913,
    18914,
    18949,
    18959,
    18978,
    19011,
    19065,
    19066,
    19088,
    19107,
    19113,
    19123,
    19129,
    19134,
    19141,
    19144,
    19153,
    19184,
    19235,
    19238,
    19239,
    19245,
    19261,
    19306,
    19324,
    19328,
    19343,
    19347,
    19356,
    19376,
    19377,
    19385,
    19421,
    19457,
    19468,
    19475,
    19494,
    19506,
    19513,
    19514,
    19536,
    19546,
    19549,
    19564,
    19587,
    19595,
    19611,
    19630,
    19676,
    19687,
    19704,
    19707,
    19713,
    19738,
    19741,
    19778,
    19788,
    19799,
    19814,
    19821,
    19886,
    19896,
    19901,
    19916,
    19930,
    19946,
    19956,
    19973,
    19987,
    20024,
    20026,
    20047,
    20078,
    20098,
    20103,
    20136,
    20206,
    20225,
    20232,
    20235,
    20258,
    20267,
    20281,
    20289,
    20305,
    20307,
    20318,
    20320,
    20338,
    20354,
    20356,
    20375,
    20382,
    20386,
    20388,
    20390,
    20398,
    20418,
    20447,
    20472,
    20484,
    20571,
    20574,
    20582,
    20591,
    20625,
    20635,
    20698,
    20707,
    20709,
    20711,
    20741,
    20747,
    20749,
    20758,
    20770,
    20778,
    20779,
    20833,
    20862,
    20867,
    20879,
    20885,
    20912,
    20919,
    20941,
    20996,
    21005,
    21012,
    21035,
    21054,
    21082,
    21096,
    21103,
    21128,
    21135,
    21168,
    21174,
    21182,
    21200,
    21205,
    21227,
    21228,
    21230,
    21238,
    21246,
    21253,
    21280,
    21293,
    21298,
    21358,
    21370,
    21406,
    21421,
    21457,
    21518,
    21530,
    21549,
    21560,
    21562,
    21579,
    21613,
    21620,
    21636,
    21650,
    21654,
    21656,
    21668,
    21672,
    21675,
    21680,
    21686,
    21689,
    21696,
    21702,
    21704,
    21731,
    21783,
    21796,
    21798,
    21849,
    21865,
    21905,
    21906,
    21929,
    21949,
    21956,
    21972,
    21974,
    21987,
    22009,
    22022,
    22025,
    22042,
    22050,
    22071,
    22074,
    22078,
    22084,
    22085,
    22116,
    22129,
    22158,
    22165,
    22224,
    22225,
    22247,
    22297,
    22312,
    22322,
    22336,
    22337,
    22343,
    22345,
    22367,
    22370,
    22428,
    22438,
    22460,
    22498,
    22525,
    22558,
    22580,
    22597,
    22607,
    22612,
    22614,
    22649,
    22663,
    22677,
    22689,
    22701,
    22712,
    22726,
    22746,
    22754,
    22762,
    22768,
    22788,
    22796,
    22842,
    22857,
    22859,
    22861,
    22886,
    22895,
    22940,
    22956,
    22983,
    22987,
    22988,
    22991,
    23014,
    23032,
    23052,
    23053,
    23083,
    23093,
    23135,
    23147,
    23158,
    23174,
    23231,
    23254,
    23272,
    23315,
    23341,
    23351,
    23359,
    23369,
    23373,
    23398,
    23421,
    23426,
    23431,
    23433,
    23439,
    23443,
    23444,
    23459,
    23474,
    23478,
    23479,
    23482,
    23509,
    23515,
    23530,
    23547,
    23569,
    23571,
    23585,
    23599,
    23600,
    23625,
    23637,
    23669,
    23687,
    23754,
    23758,
    23781,
    23794,
    23866,
    23872,
    23884,
    23891,
    23894,
    23912,
    23934,
    24008,
    24011,
    24021,
    24023,
    24032,
    24041,
    24045,
    24071,
    24076,
    24077,
    24097,
    24123,
    24135,
    24144,
    24147,
    24148,
    24159,
    24183,
    24197,
    24212,
    24216,
    24226,
    24254,
    24265,
    24305,
    24312,
    24316,
    24320,
    24333,
    24337,
    24338,
    24345,
    24352,
    24365,
    24375,
    24377,
    24389,
    24391,
    24429,
    24437,
    24447,
    24460,
    24476,
    24485,
    24497,
    24520,
    24539,
    24616,
    24697,
    24727,
    24734,
    24735,
    24749,
    24750,
    24772,
    24796,
    24816,
    24817,
    24825,
    24827,
    24831,
    24840,
    24850,
    24853,
    24864,
    24881,
    24948,
    24974,
    24978,
    24985,
    25010,
    25011,
    25035,
    25046,
    25049,
    25089,
    25107,
    25110,
    25125,
    25138,
    25145,
    25162,
    25190,
    25209,
    25249,
    25289,
    25315,
    25319,
    25321,
    25340,
    25346,
    25389,
    25401,
    25409,
    25435,
    25447,
    25452,
    25464,
    25467,
    25468,
    25490,
    25495,
    25501,
    25521,
    25526,
    25534,
    25547,
    25556,
    25571,
    25589,
    25592,
    25624,
    25639,
    25644,
    25703,
    25731,
    25733,
    25746,
    25759,
    25772,
    25781,
    25786,
    25797,
    25805,
    25821,
    25829,
    25865,
    25870,
    25885,
    25890,
    25897,
    25906,
    25910,
    25912,
    25917,
    25923,
    25928,
    25931,
    25933,
    25956,
    25974,
    26027,
    26043,
    26072,
    26074,
    26082,
    26087,
    26097,
    26126,
    26169,
    26188,
    26230,
    26238,
    26245,
    26254,
    26259,
    26280,
    26285,
    26311,
    26336,
    26384,
    26405,
    26409,
    26432,
    26442,
    26454,
    26469,
    26487,
    26496,
    26506,
    26525,
    26546,
    26556,
    26566,
    26578,
    26579,
    26601,
    26609,
    26637,
    26690,
    26717,
    26731,
    26771,
    26772,
    26782,
    26794,
    26809,
    26828,
    26840,
    26850,
    26853,
    26856,
    26861,
    26903,
    26919,
    26927,
    26974,
    26999,
    27007,
    27010,
    27027,
    27042,
    27050,
    27062,
    27070,
    27085,
    27095,
    27113,
    27119,
    27126,
    27144,
    27151,
    27166,
    27184,
    27189,
    27191,
    27209,
    27214,
    27220,
    27249,
    27260,
    27271,
    27275,
    27301,
    27311,
    27316,
    27325,
    27352,
    27365,
    27398,
    27424,
    27427,
    27435,
    27438,
    27439,
    27443,
    27486,
    27487,
    27506,
    27510,
    27517,
    27538,
    27568,
    27580,
    27584,
    27610,
    27614,
    27631,
    27640,
    27654,
    27659,
    27668,
    27676,
    27701,
    27704,
    27757,
    27762,
    27766,
    27767,
    27771,
    27772,
    27818,
    27845,
    27855,
    27866,
    27876,
    27884,
    27901,
    27907,
    27978,
    27982,
    27999,
    28019,
    28038,
    28075,
    28094,
    28107,
    28114,
    28116,
    28127,
    28145,
    28154,
    28168,
    28175,
    28197,
    28207,
    28247,
    28261,
    28266,
    28272,
    28281,
    28311,
    28325,
    28329,
    28336,
    28348,
    28372,
    28375,
    28382,
    28389,
    28394,
    28406,
    28429,
    28447,
    28489,
    28520,
    28565,
    28570,
    28581,
    28653,
    28654,
    28665,
    28669,
    28671,
    28673,
    28680,
    28706,
    28712,
    28743,
    28757,
    28864,
    28875,
    28880,
    28907,
    28918,
    28927,
    28958,
    28974,
    28978,
    28987,
    29043,
    29076,
    29083,
    29084,
    29089,
    29110,
    29113,
    29122,
    29128,
    29150,
    29184,
    29191,
    29209,
    29220,
    29237,
    29240,
    29254,
    29324,
    29333,
    29345,
    29355,
    29359,
    29376,
    29389,
    29465,
    29487,
    29529,
    29555,
    29562,
    29592,
    29605,
    29616,
    29621,
    29633,
    29636,
    29675,
    29710,
    29721,
    29766,
    29768,
    29771,
    29773,
    29776,
    29811,
    29816,
    29833,
    29836,
    29879,
    29893,
    29932,
    29941,
    29955,
    29963,
    29975,
    29976,
    30006,
    30008,
    30018,
    30034,
    30085,
    30122,
    30139,
    30154,
    30212,
    30218,
    30247,
    30260,
    30263,
    30274,
    30323,
    30325,
    30354,
    30375,
    30376,
    30389,
    30390,
    30395,
    30407,
    30409,
    30424,
    30438,
    30458,
    30463,
    30467,
    30469,
    30475,
    30484,
    30493,
    30520,
    30523,
    30535,
    30558,
    30584,
    30625,
    30631,
    30634,
    30638,
    30645,
    30678,
    30695,
    30723,
    30734,
    30736,
    30749,
    30750,
    30757,
    30779,
    30793,
    30828,
    30831,
    30838,
    30850,
    30873,
    30885,
    30916,
    30917,
    30948,
    30949,
    30958,
    30981,
    30991,
    31159,
    31200,
    31218,
    31225,
    31239,
    31257,
    31278,
    31286,
    31295,
    31296,
    31305,
    31307,
    31338,
    31356,
    31368,
    31411,
    31418,
    31424,
    31436,
    31470,
    31482,
    31483,
    31487,
    31501,
    31540,
    31567,
    31587,
    31601,
    31673,
    31688,
    31706,
    31707,
    31715,
    31723,
    31729,
    31732,
    31740,
    31764,
    31781,
    31797,
    31813,
    31816,
    31856,
    31870,
    31884,
    31888,
    31906,
    31911,
    31931,
    31933,
    31951,
    31975,
    31980,
    31982,
    32013,
    32014,
    32028,
    32057,
    32068,
    32083,
    32087,
    32090,
    32148,
    32162,
    32181,
    32184,
    32203,
    32208,
    32224,
    32254,
    32263,
    32268,
    32279,
    32295,
    32314,
    32326,
    32343,
    32356,
    32373,
    32386,
    32423,
    32431,
    32450,
    32465,
    32484,
    32495,
    32511,
    32544,
    32545,
    32548,
    32574,
    32585,
    32596,
    32598,
    32602,
    32609,
    32616,
    32623,
    32624,
    32636,
    32647,
    32691,
    32735,
    32737,
    32756,
    32798,
    32805,
    32843,
    32868,
    32872,
    32881,
    32926,
    32968,
    32985,
    32989,
    32991,
    32996,
    33010,
    33013,
    33016,
    33021,
    33028,
    33030,
    33077,
    33084,
    33089,
    33093,
    33104,
    33130,
    33152,
    33157,
    33173,
    33179,
    33199,
    33293,
    33294,
    33333,
    33351,
    33352,
    33397,
    33413,
    33418,
    33419,
    33424,
    33436,
    33440,
    33442,
    33478,
    33484,
    33498,
    33543,
    33546,
    33552,
    33556,
    33579,
    33593,
    33621,
    33626,
    33641,
    33645,
    33660,
    33666,
    33673,
    33687,
    33694,
    33711,
    33734,
    33739,
    33761,
    33766,
    33783,
    33794,
    33800,
    33804,
    33810,
    33826,
    33862,
    33871,
    33916,
    33928,
    33929,
    33933,
    33943,
    33947,
    33949,
    33955,
    33959,
    33986,
    33987,
    33989,
    33999,
    34007,
    34010,
    34026,
    34052,
    34081,
    34082,
    34083,
    34135,
    34141,
    34143,
    34149,
    34184,
    34203,
    34232,
    34297,
    34299,
    34300,
    34321,
    34322,
    34327,
    34331,
    34332,
    34341,
    34369,
    34403,
    34410,
    34420,
    34425,
    34429,
    34480,
    34483,
    34499,
    34546,
    34577,
    34583,
    34590,
    34600,
    34622,
    34629,
    34642,
    34649,
    34670,
    34690,
    34759,
    34764,
    34773,
    34793,
    34799,
    34811,
    34812,
    34820,
    34821,
    34829,
    34864,
    34866,
    34885,
    34895,
    34923,
    34939,
    34944,
    34973,
    34985,
    34992,
    35017,
    35049,
    35055,
    35063,
    35065,
    35066,
    35075,
    35099,
    35106,
    35115,
    35117,
    35125,
    35146,
    35173,
    35178,
    35184,
    35190,
    35199,
    35200,
    35208,
    35219,
    35229,
    35248,
    35274,
    35289,
    35293,
    35297,
    35306,
    35311,
